{
  "format": "graph-model",
  "generatedBy": "2.19.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "input_sequence": {
        "name": "input_sequence:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [{ "size": "-1" }, { "size": "45" }, { "size": "258" }]
        }
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "22" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "3" },
                  { "size": "258" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "128" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/Squeeze",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/ExpandDims/dim",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1152" }, { "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "128" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "22" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "22" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "input_sequence",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [{ "size": "-1" }, { "size": "45" }, { "size": "258" }]
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "input_sequence",
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim"
        ],
        "attr": { "Tdim": { "type": "DT_INT32" }, "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1",
          "StatefulPartitionedCall/functional_1/conv1d_1/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "VkFMSUQ=" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/BiasAdd",
        "op": "Squeeze",
        "input": ["StatefulPartitionedCall/functional_1/conv1d_1/convolution"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "squeeze_dims": { "list": { "i": ["-3"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1/Relu",
        "op": "Relu",
        "input": ["StatefulPartitionedCall/functional_1/conv1d_1/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1/Relu",
          "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/ExpandDims/dim"
        ],
        "attr": { "Tdim": { "type": "DT_INT32" }, "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/ExpandDims"
        ],
        "attr": {
          "ksize": { "list": { "i": ["1", "1", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "1", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "squeeze_dims": { "list": { "i": ["1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/Squeeze",
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim"
        ],
        "attr": { "Tdim": { "type": "DT_INT32" }, "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims",
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1",
          "StatefulPartitionedCall/functional_1/conv1d_1_2/Squeeze"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": { "i": "0" },
          "data_format": { "s": "TkhXQw==" },
          "filter_format": { "s": "SFdJTw==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "num_args": { "i": "1" },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "TArgs": { "list": { "type": ["DT_FLOAT"] } },
          "padding": { "s": "VkFMSUQ=" },
          "use_cudnn_on_gpu": { "b": true },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/BiasAdd",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "squeeze_dims": { "list": { "i": ["-3"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/Relu",
        "op": "Relu",
        "input": ["StatefulPartitionedCall/functional_1/conv1d_1_2/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/ExpandDims",
        "op": "ExpandDims",
        "input": [
          "StatefulPartitionedCall/functional_1/conv1d_1_2/Relu",
          "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/ExpandDims/dim"
        ],
        "attr": { "Tdim": { "type": "DT_INT32" }, "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/ExpandDims"
        ],
        "attr": {
          "ksize": { "list": { "i": ["1", "1", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "padding": { "s": "VkFMSUQ=" },
          "strides": { "list": { "i": ["1", "1", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/Squeeze",
        "op": "Squeeze",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "squeeze_dims": { "list": { "i": ["1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/Squeeze",
          "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/functional_1/flatten_1/Reshape",
          "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_1_2/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/functional_1/dense_1/Relu",
          "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
          "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/functional_1/dense_1_2/Relu",
          "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
          "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/functional_1/dense_2_1/Softmax",
        "op": "Softmax",
        "input": ["StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Softmax"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 2129 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1/convolution/ExpandDims_1",
          "shape": [1, 3, 258, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1/Squeeze",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1/MaxPool1d/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/convolution/ExpandDims_1",
          "shape": [1, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/conv1d_1_2/Squeeze",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/max_pooling1d_1_2/MaxPool1d/ExpandDims/dim",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/flatten_1/Reshape/shape",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp",
          "shape": [1152, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp",
          "shape": [128, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp",
          "shape": [64, 22],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp",
          "shape": [22],
          "dtype": "float32"
        }
      ]
    }
  ]
}
